#+title: Sprint Backlog 00 for Patrick
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) epic(e) }

* Mission Statement

- Create a Football Manager Game

* Stories

Stories you are working on this sprint.

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-03-09 Fri 12:14]
| <75>                                                                        |        |      |      |       |
| Headline                                                                    | Time   |      |      |     % |
|-----------------------------------------------------------------------------+--------+------+------+-------|
| *Total time*                                                                | *9:01* |      |      | 100.0 |
|-----------------------------------------------------------------------------+--------+------+------+-------|
| Stories                                                                     | 9:01   |      |      | 100.0 |
| Active                                                                      |        | 9:01 |      | 100.0 |
| STARTED Sprint and product backlog grooming                                 |        |      | 0:39 |   7.2 |
| STARTED Discussing task at hand                                             |        |      | 0:17 |   3.1 |
| COMPLETED Change variables from team to table                               |        |      | 0:21 |   3.9 |
| COMPLETED Remove commented code in team.cpp/hpp                             |        |      | 0:13 |   2.4 |
| COMPLETED Add new teams and players to epl.data                             |        |      | 0:31 |   5.7 |
| COMPLETED Create user.hpp                                                   |        |      | 0:12 |   2.2 |
| STARTED Clean up files                                                      |        |      | 0:15 |   2.8 |
| COMPLETED Add constructors to user.hpp                                      |        |      | 0:24 |   4.4 |
| COMPLETED Add class to game.hpp                                             |        |      | 0:22 |   4.1 |
| COMPLETED Set next task                                                     |        |      | 0:16 |   3.0 |
| COMPLETED Clean game.cpp/hpp                                                |        |      | 0:29 |   5.4 |
| COMPLETED Add game.cpp                                                      |        |      | 0:18 |   3.3 |
| COMPLETED Add user.cpp                                                      |        |      | 0:12 |   2.2 |
| COMPLETED Clean game and user.hpp/cpp                                       |        |      | 0:44 |   8.1 |
| CANCELLED Look and attempt to fix "quit" bug                                |        |      | 0:12 |   2.2 |
| COMPLETED Study session on Constructors                                     |        |      | 2:04 |  22.9 |
| COMPLETED Review last push                                                  |        |      | 0:08 |   1.5 |
| COMPLETED Make users display from users.cpp                                 |        |      | 1:24 |  15.5 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:


*** STARTED Sprint and product backlog grooming                       :story:
    CLOCK: [2018-03-08 Thu 16:42]--[2018-03-08 Thu 16:56] =>  0:14
    CLOCK: [2018-03-08 Thu 13:28]--[2018-03-08 Thu 13:35] =>  0:07
    CLOCK: [2018-03-06 Tue 16:28]--[2018-03-06 Tue 16:39] =>  0:11
    CLOCK: [2018-03-06 Tue 15:54]--[2018-03-06 Tue 15:58] =>  0:04
    CLOCK: [2018-03-06 Tue 14:57]--[2018-03-06 Tue 15:00] =>  0:03

Updates to sprint and product backlog.

*** STARTED Discussing task at hand
    CLOCK: [2018-03-09 Fri 11:43]--[2018-03-09 Fri 11:54] =>  0:11
    CLOCK: [2018-03-08 Thu 10:00]--[2018-03-08 Thu 10:06] =>  0:06

*** COMPLETED Change variables from team to table
    CLOSED: [2018-03-06 Tue 14:55]
    CLOCK: [2018-03-06 Tue 11:31]--[2018-03-06 Tue 11:52] =>  0:21

- Drop properties from team class
- Drop properties from data file
- Run code to make sure reading still works

*** COMPLETED Remove commented code in team.cpp/hpp
    CLOSED: [2018-03-06 Tue 14:57]
    CLOCK: [2018-03-06 Tue 14:43]--[2018-03-06 Tue 14:56] =>  0:13

*** COMPLETED Add new teams and players to epl.data
    CLOSED: [2018-03-06 Tue 15:55]
    CLOCK: [2018-03-06 Tue 15:35]--[2018-03-06 Tue 15:54] =>  0:19
    CLOCK: [2018-03-06 Tue 15:15]--[2018-03-06 Tue 15:27] =>  0:12

- Link: https://www.premierleague.com/players

- Use link to add all teams in premier league
- Only and one player per team
- And add players position

*** COMPLETED Create user.hpp
    CLOSED: [2018-03-06 Tue 16:56]
    CLOCK: [2018-03-06 Tue 16:43]--[2018-03-06 Tue 16:55] =>  0:12

- Create user.hpp file
- Create class for user
- Add to class:
  - string name
  - string team_name

*** STARTED Clean up files
    CLOCK: [2018-03-07 Wed 09:13]--[2018-03-07 Wed 09:28] =>  0:15

- Remove white-spaces
- Break line that are too long
- Delete any commented out code

*** COMPLETED Add constructors to user.hpp
    CLOSED: [2018-03-07 Wed 10:55]
    CLOCK: [2018-03-07 Wed 09:30]--[2018-03-07 Wed 09:54] =>  0:24

- Read on Constructors:
  - http://www.cplusplus.com/doc/tutorial/classes/

- Default constructor, user();
- One with arguments, user(argument1, argument2);

*** COMPLETED Add class to game.hpp
    CLOSED: [2018-03-07 Wed 11:49]
    CLOCK: [2018-03-07 Wed 11:27]--[2018-03-07 Wed 11:49] =>  0:22

- Reference diagram
- Add to class:
  - vector<user>
  - int current_match_day

*** COMPLETED Set next task
    CLOSED: [2018-03-07 Wed 15:45]
    CLOCK: [2018-03-07 Wed 14:55]--[2018-03-07 Wed 15:11] =>  0:16

*** COMPLETED Clean game.cpp/hpp
    CLOSED: [2018-03-07 Wed 16:22]
    CLOCK: [2018-03-07 Wed 15:14]--[2018-03-07 Wed 15:43] =>  0:29

- Uncomment out correct constructor
- Remove game();
- Change:
  - game_setup(std::vector<user> user, int current_match_day);
- To:
  - game_setup(std::vector<user> users, int current_match_day);
- Make current_match_day private
- Add:
  - std::vector<user> users_;
  - int current_match_day_;

*** COMPLETED Add game.cpp
    CLOSED: [2018-03-07 Wed 16:22]
    CLOCK: [2018-03-07 Wed 15:48]--[2018-03-07 Wed 16:06] =>  0:18
- Connect game.hpp
- Write Function:
  - game::game_setup(std::vector<user> users, int current_match_day)
    : users_(users), current_match_day_(current_match_day)

*** COMPLETED Add user.cpp
    CLOSED: [2018-03-08 Thu 09:29]
    CLOCK: [2018-03-08 Thu 09:17]--[2018-03-08 Thu 09:29] =>  0:12

- Create file
- Write in method and constructor functions

*** COMPLETED Clean game and user.hpp/cpp
    CLOSED: [2018-03-08 Thu 10:16]
    CLOCK: [2018-03-08 Thu 10:06]--[2018-03-08 Thu 10:16] =>  0:10
    CLOCK: [2018-03-08 Thu 09:29]--[2018-03-08 Thu 10:03] =>  0:34


- Correct constructor name
- Fix indentations
*** CANCELLED Look and attempt to fix "quit" bug
    CLOSED: [2018-03-08 Thu 14:13]
    CLOCK: [2018-03-08 Thu 13:35]--[2018-03-08 Thu 13:47] =>  0:12

- In engine.cpp
- look for what happens after:
  - user input "2"
  - then "N"

*** COMPLETED Study session on Constructors
    CLOSED: [2018-03-08 Thu 16:42]
    CLOCK: [2018-03-08 Thu 16:00]--[2018-03-08 Thu 16:42] =>  0:42
    CLOCK: [2018-03-08 Thu 15:16]--[2018-03-08 Thu 15:48] =>  0:32
    CLOCK: [2018-03-08 Thu 14:39]--[2018-03-08 Thu 15:06] =>  0:27
    CLOCK: [2018-03-08 Thu 14:15]--[2018-03-08 Thu 14:38] =>  0:23


- Videos:
  - Buckys C++ Programming Tutorials: https://www.youtube.com/watch?v=_b7odUc7lg0-
  - Constructors and Destructors: https://www.youtube.com/watch?v=095BHgxo_zE

- Written:
  - https://www.geeksforgeeks.org/constructors-c/
  - https://www.tutorialspoint.com/cplusplus/cpp_constructor_destructor.htm
  - http://www.cplusplus.com/doc/tutorial/classes/

- Quizzes:
  - https://www.geeksforgeeks.org/c-plus-plus-gq/constructors-gq/
  - https://www.ooportal.com/building-cplusplus-classes/module4/cplus-constructor-quiz.php
  - https://www.proprofs.com/quiz-school/quizshow.php?title=cc-programming-language-set-2&q=1
**
*** COMPLETED Review last push
    CLOSED: [2018-03-08 Thu 15:16]
    CLOCK: [2018-03-08 Thu 15:08]--[2018-03-08 Thu 15:16] =>  0:08

- Niams push: Fixed table
*** COMPLETED Make users display from users.cpp
    CLOSED: [2018-03-09 Fri 11:57]
    CLOCK: [2018-03-09 Fri 11:54]--[2018-03-09 Fri 11:56] =>  0:02
    CLOCK: [2018-03-09 Fri 11:09]--[2018-03-09 Fri 11:43] =>  0:34
    CLOCK: [2018-03-09 Fri 09:39]--[2018-03-09 Fri 10:27] =>  0:48


- Create:
  - Inside user.hpp
    - void display();
  - Inside user.cpp
    - void user::display(){}

- Try to copy the for loop from engine.cpp
- Paste into user::display()

- Inside engine.cpp
  - Where original for loop was
  - Write:
    - user u;
    - u.display();

- Change u in, user u
  - to: user displayU;
  - Remove this

- Remove for loop from user.cpp
- Re-add for loop to engine.cpp

- Write inside for loop
  - u.display();

** Deprecated
